Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.7.81/edc/ATSAMD10D14AM.PIC
      <edc:SFRDef ltx:memberofperipheral="SYSCTRL" edc:cname="DPLLSTATUS" edc:nzwidth="0x8" edc:access="----rrrr" edc:por="00000000" edc:mclr="00000000" edc:impl="0xF" edc:_addr="0x40000850">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SYSCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:nzwidth="0x1" edc:desc="DPLL Lock Status"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:nzwidth="0x1" edc:desc="Output Clock Ready"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="DPLL Enable"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x1" edc:desc="Divider Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3AF" edc:_addr="0x40000851"/>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="-------n" edc:por="00000000" edc:mclr="00000000" edc:impl="0x1" edc:_addr="0x40000C00">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="STATUS" edc:nzwidth="0x8" edc:access="r-------" edc:por="00000000" edc:mclr="00000000" edc:impl="0x80" edc:_addr="0x40000C01">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="SYNCBUSY" edc:nzwidth="0x1" edc:desc="Synchronization Busy Status"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="CLKCTRL" edc:nzwidth="0x10" edc:access="nn--nnnn--nnnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xCF3F" edc:_addr="0x40000C02">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x6" edc:desc="Generic Clock Selection ID">
              <edc:SFRFieldSemantic edc:cname="DFLL48" edc:desc="DFLL48" edc:when="(field &amp; 0x3F) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL" edc:desc="FDPLL" edc:when="(field &amp; 0x3F) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="FDPLL32K" edc:desc="FDPLL32K" edc:when="(field &amp; 0x3F) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="WDT" edc:desc="WDT" edc:when="(field &amp; 0x3F) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="RTC" edc:desc="RTC" edc:when="(field &amp; 0x3F) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="EIC" edc:desc="EIC" edc:when="(field &amp; 0x3F) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_0" edc:desc="EVSYS_0" edc:when="(field &amp; 0x3F) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_1" edc:desc="EVSYS_1" edc:when="(field &amp; 0x3F) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_2" edc:desc="EVSYS_2" edc:when="(field &amp; 0x3F) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_3" edc:desc="EVSYS_3" edc:when="(field &amp; 0x3F) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_4" edc:desc="EVSYS_4" edc:when="(field &amp; 0x3F) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="EVSYS_5" edc:desc="EVSYS_5" edc:when="(field &amp; 0x3F) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="SERCOMX_SLOW" edc:desc="SERCOMX_SLOW" edc:when="(field &amp; 0x3F) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM0_CORE" edc:desc="SERCOM0_CORE" edc:when="(field &amp; 0x3F) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM1_CORE" edc:desc="SERCOM1_CORE" edc:when="(field &amp; 0x3F) == 0xF"/>
              <edc:SFRFieldSemantic edc:cname="SERCOM2_CORE" edc:desc="SERCOM2_CORE" edc:when="(field &amp; 0x3F) == 0x10"/>
              <edc:SFRFieldSemantic edc:cname="TCC0" edc:desc="TCC0" edc:when="(field &amp; 0x3F) == 0x11"/>
              <edc:SFRFieldSemantic edc:cname="TC1_TC2" edc:desc="TC1_TC2" edc:when="(field &amp; 0x3F) == 0x12"/>
              <edc:SFRFieldSemantic edc:cname="ADC" edc:desc="ADC" edc:when="(field &amp; 0x3F) == 0x13"/>
              <edc:SFRFieldSemantic edc:cname="AC_DIG" edc:desc="AC_DIG" edc:when="(field &amp; 0x3F) == 0x14"/>
              <edc:SFRFieldSemantic edc:cname="AC_ANA" edc:desc="AC_ANA" edc:when="(field &amp; 0x3F) == 0x15"/>
              <edc:SFRFieldSemantic edc:cname="DAC" edc:desc="DAC" edc:when="(field &amp; 0x3F) == 0x16"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="GEN" edc:nzwidth="0x4" edc:desc="Generic Clock Generator">
              <edc:SFRFieldSemantic edc:cname="GCLK0" edc:desc="Generic clock generator 0" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="GCLK1" edc:desc="Generic clock generator 1" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="GCLK2" edc:desc="Generic clock generator 2" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="GCLK3" edc:desc="Generic clock generator 3" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="GCLK4" edc:desc="Generic clock generator 4" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="GCLK5" edc:desc="Generic clock generator 5" edc:when="(field &amp; 0xF) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CLKEN" edc:nzwidth="0x1" edc:desc="Clock Enable"/>
            <edc:SFRFieldDef edc:cname="WRTLOCK" edc:nzwidth="0x1" edc:desc="Write Lock"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENCTRL" edc:nzwidth="0x20" edc:access="----------nnnnnn---nnnnn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F1F0F" edc:_addr="0x40000C04">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x4" edc:desc="Generic Clock Generator Selection"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="SRC" edc:nzwidth="0x5" edc:desc="Source Select">
              <edc:SFRFieldSemantic edc:cname="XOSC" edc:desc="XOSC oscillator output" edc:when="(field &amp; 0x1F) == 0"/>
              <edc:SFRFieldSemantic edc:cname="GCLKIN" edc:desc="Generator input pad" edc:when="(field &amp; 0x1F) == 1"/>
              <edc:SFRFieldSemantic edc:cname="GCLKGEN1" edc:desc="Generic clock generator 1 output" edc:when="(field &amp; 0x1F) == 2"/>
              <edc:SFRFieldSemantic edc:cname="OSCULP32K" edc:desc="OSCULP32K oscillator output" edc:when="(field &amp; 0x1F) == 3"/>
              <edc:SFRFieldSemantic edc:cname="OSC32K" edc:desc="OSC32K oscillator output" edc:when="(field &amp; 0x1F) == 4"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32K" edc:desc="XOSC32K oscillator output" edc:when="(field &amp; 0x1F) == 5"/>
              <edc:SFRFieldSemantic edc:cname="OSC8M" edc:desc="OSC8M oscillator output" edc:when="(field &amp; 0x1F) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DFLL48M" edc:desc="DFLL48M output" edc:when="(field &amp; 0x1F) == 7"/>
              <edc:SFRFieldSemantic edc:cname="DPLL96M" edc:desc="DPLL96M output" edc:when="(field &amp; 0x1F) == 8"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GENEN" edc:nzwidth="0x1" edc:desc="Generic Clock Generator Enable"/>
            <edc:SFRFieldDef edc:cname="IDC" edc:nzwidth="0x1" edc:desc="Improve Duty Cycle"/>
            <edc:SFRFieldDef edc:cname="OOV" edc:nzwidth="0x1" edc:desc="Output Off Value"/>
            <edc:SFRFieldDef edc:cname="OE" edc:nzwidth="0x1" edc:desc="Output Enable"/>
            <edc:SFRFieldDef edc:cname="DIVSEL" edc:nzwidth="0x1" edc:desc="Divide Selection">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Divide input directly by divider factor" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide input by 2^(divider factor+ 1)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:nzwidth="0x1" edc:desc="Run in Standby"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="GCLK" edc:cname="GENDIV" edc:nzwidth="0x20" edc:access="--------nnnnnnnnnnnnnnnn----nnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFF0F" edc:_addr="0x40000C08">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="GCLK">
            <edc:SFRFieldDef edc:cname="ID" edc:nzwidth="0x4" edc:desc="Generic Clock Generator Selection"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:nzwidth="0x10" edc:desc="Division Factor"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F4" edc:_addr="0x40000C0C"/>
      <edc:SFRDef ltx:memberofperipheral="WDT" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="n----nn-" edc:por="00000000" edc:mclr="00000000" edc:impl="0x86" edc:_addr="0x40001000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="WDT">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
            <edc:SFRFieldDef edc:cname="WEN" edc:nzwidth="0x1" edc:desc="Watchdog Timer Window Mode Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ALWAYSON" edc:nzwidth="0x1" edc:desc="Always-On"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
