Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.7.81/edc/ATSAMD10D14AM.PIC
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS3PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007098">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS3PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100709C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS4PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070A0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS4PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070A4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS5PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070A8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS5PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070AC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS6PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070B0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS6PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x410070B4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
